app/controllers/surveys_controller.rb

INSERT INTO "surveys" ("created_at", "name", "updated_at", "year") VALUES (?, ?, ?, ?)  [["created_at", Tue, 25 Jun 2013 11:19:46 UTC +00:00], ["name", "ashish"], ["updated_at", Tue, 25 Jun 2013 11:19:46 UTC +00:00], ["year", 1233]]
---
  def create
    @surveys = Survey.new(params[:survey])
    if @surveys.save

SELECT "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT 1  [["id", "6"]]
---
  def edit
    #p params[:id]
    @surveys = Survey.find(params[:id])

SELECT "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT 1  [["id", "6"]]
UPDATE "surveys" SET "name" = 'changed', "year" = 3112, "updated_at" = '2013-06-27 05:44:15.433519' WHERE "surveys"."id" = 6
---
  def update
    @surveys = Survey.find(params[:id])
    if @surveys.update_attributes(params[:survey])

SELECT "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT 1  [["id", "6"]]
DELETE FROM "surveys" WHERE "surveys"."id" = ?  [["id", 6]]
---
  def destroy
    @surveys = Survey.find(params[:id])

    if @surveys.destroy

SELECT "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT 1  [["id", "6"]]
---
  def show
    @survey = Survey.find(params[:id])